import React from 'react'
import { useParams } from 'react-router-dom'
import { FormattedMessage } from 'react-intl'
import { useIntl } from 'react-intl'
import './NewsDetail.scss'

const newsList = [
  {
    id: 19,
    imageUrlUk: '/img/photo_news/news19.png',
    imageUrlEn: '/img/photo_news/news19.png',
    title:
      'ПНРМ провели перший тренінг для менеджерів науки України: від мрії до плану',
    date: '4–5 грудня 2025 року',
    description: `Мрії повинні збуватися — особливо тоді, коли вони перетворюються на чіткі плани, що втілюються в життя”, – наголосила Ганна Толстанова, проректорка з наукової роботи Київського національного університету імені Тараса Шевченка, співзасновниця Професійної мережі менеджерів науки та освіти України (PNRM Ukraine), членкиня правління International Network of Research Management Societies (INORMS). 4–5 грудня 2025 року на базі Київського національного університету імені Тараса Шевченка відбулася ІІІ щорічна зустріч членів та партнерів PNRM Ukraine, поєднана з першим Всеукраїнським тренінгом для менеджерів і адміністраторів науки України. У заході взяли участь 85 менеджерів науки з 40 закладів вищої освіти та наукових установ України. Подія стала можливою без грантів і гонорарів — завдяки єднанню людей зі спільними цінностями та прагненню впроваджувати європейські практики. Нашою головною метою було показати, що менеджер науки — це не просто технічна підтримка, а ключова людина, яка допомагає університету розвиватися й бути успішним. Ми хотіли дати учасникам можливість краще зрозуміти свою роль і побачити, як їхня робота впливає на якість досліджень та міжнародну співпрацю. Також тренінг став майданчиком, де можна було поділитися власним досвідом, розповісти про виклики й знайти нові ідеї для щоденної роботи. Захід пройшов у дуже теплій і дружній атмосфері. Тут панували відкритість, взаємопідтримка та готовність співпрацювати. Учасники не просто слухали спікерів, а активно включалися в дискусії, ставили запитання й ділилися своїми історіями. Ми прагнули, щоб цей тренінг став першим кроком до створення справжньої професійної спільноти менеджерів науки в Україні — людей, які є конкурентоздатними, відкритими до діалогу, готовими постійно навчатися й розвиватися разом. PNRM висловлюють щиру вдячність: - Володимиру Бугрову, ректору КНУ імені Тараса Шевченка — за підтримку та віру в цінність ініціативи; - Проректорам з наукової роботи — за направлення працівників НДЧ та участь у дискусіях; - Ользі Полотській, виконавчій директорці Національного фонду досліджень України — за вітальне слово та презентацію можливостей фонду; - Ігору Таранову, начальнику відділу “Офіс Горизонт Європа в Україні” — за мотивацію працювати з Horizon Europe; - Владиславу Кондусу, начальнику науково-дослідної частини Сумського державного університету — за відвертість у розкритті секретів ефективного менеджменту; - Яні Сичіковій, проректорці з наукової роботи Бердянського державного педагогічного університету — за практичні інструменти цифровізації та застосування ШІ; - Галині Правдзивій, провідній економістці ПФВ КНУ імені Тараса Шевченка — за доповідь практики-плановика; - Віталію Гризі, старшому науковому співробітнику відділу інноваційної політики, економіки та організації високих технологій ДУ «Інститут економіки та прогнозування НАН України» — за пояснення основ і досвіду ЄС; - Анні Фоменко, науковій співробітниці та викладачці International Management Program Університету прикладних наук, технологій, бізнесу та дизайну у Вісмарі (Німеччина), кандидатці економічних наук, менеджерці проєкту EUComplianceM4UA, членкині DUAG та PNRM Ukraine — за розмову про комплаєнс та науковий супровід; - Роману Нестеренку, заступнику начальника управління міжнародних відносин Харківського національного університету імені В.Н. Каразіна, та Олені Почаєвець, завідувачці відділу проєктної діяльності НДЧ КНУ — за модерування Світового кафе та глибоку дискусію; - Олександру Ковальчуку, проректору з наукової роботи та інноваційного розвитку КНУБА — за огляд можливостей COST; - Оксані Шевчук, керівниці відділу менеджменту наукових проєктів ТНМУ, та Наталії Бутич, координаторці міжнародної співпраці зі Східною Європою в Ганноверському університеті ім. Лейбніца — за розповідь про міжнародні мережі менеджерів науки. Окрема подяка Київському національному університету імені Тараса Шевченка, Німецько-Українському Академічному Товариству, Національному фонду досліджень України, Hochschule Wismar та команді проєкту EUComplianceM4UA — за партнерську підтримку та розвиток теми комплаєнсу й європейських стандартів управління наукою. Щоб діяти на основі реальних потреб, команда розпочала з всеукраїнського опитування. Результати показали ключові виклики: національна грантова система, бюджетування, пошук партнерів, професійна самореалізація менеджерів науки. Відгуки учасників підтвердили: тренінг став важливим і своєчасним. Тому вже розпочато роботу над наступним етапом — створенням Національного форуму менеджерів науки України. Форум планується у співпраці з: Національним фондом досліджень України, IP-офісом, Офісом «Горизонт Європа», національними координаторами COST, Спілкою ректорів. Тепер це вже не мрія — це план, який чекає на реалізацію. Довідково: ідея створення платформи для підвищення кваліфікації менеджерів науки України виникла після участі у форумі INORMS у травні 2025 року. Саме там представниця PNRM Ukraine побачила найкращі міжнародні практики та відчула потребу у створенні подібного простору в Україні. У вересні 2025 року, під час засідання Президії Ради проректорів з наукової роботи ЗВО в Одесі, було ухвалено плани щодо проведення першого пілотного тренінгу.`,
  },
  {
    id: 18,
    imageUrlUk: '/img/photo_news/news18_ua.png',
    imageUrlEn: '/img/photo_news/news18_en.png',
    title:
      'PNRM Ukraine запрошує на ІІІ щорічну зустріч членів та партнерів мережі',
    date: '4–5 грудня 2025 року',
    description: `Запрошуємо Вас взяти участь в ІІІ щорічній зустрічі членів та партнерів PNRM Ukraine та у Всеукраїнському тренінгу менеджерів і адміністраторів науки України, які відбудуться 📅 4–5 грудня 2025 року.\nМісце проведення: м. Київ, Київський національний університет імені Тараса Шевченка\n\nЦьогоріч ми пропонуємо поєднати традиційну щорічну зустріч членів і партнерів мережі PNRM з всеукраїнським тренінгом, який, ми впевнені, стане знаковою щорічною подією у сфері науки та вищої освіти.\nОрганізатори тренінгу: Київський національний університет імені Тараса Шевченка спільно з PNRM Ukraine за підтримки Міністерства освіти і науки України\n\nФормат участі:\n• Тренінг (4-5 грудня) - виключно очний формат.\n• ІІІ щорічна зустріч PNRM (5 грудня) - гібридний формат (офлайн у Києві та онлайн для учасників з інших регіонів), присутність членів PNRM Ukraine.\n\nПрограма тренінгу прикріплена до даного листа, програма щорічної зустрічі буде надіслана пізніше.\nУсі учасники тренінгу отримають сертифікат про підвищення кваліфікації з додатком про здобуті компетентності.\n\nЗвертаємо увагу, що реєстрація на тренінг та на щорічну зустріч є окремою.\nРеєстрація:\nНа щорічну зустріч PNRM (онлайн або офлайн): https://forms.gle/4wdGtTuHy183KVZV9\nНа тренінг (очна участь): https://forms.gle/ox2au5jfRJozhtjR6\nОрганізаційний внесок для учасників тренінгу (4-5 грудня) покриває витрати на кава-брейки, обід та організаційне забезпечення тренінгу:\n• для членів PNRM Ukraine – 400 грн;\n• для інших учасників – 600 грн.\n\nОплата внеску:\nНайменування отримувача: ГО ПММОН УКРАЇНИ\nКод отримувача: 44723370\nРахунок отримувача: UA743052990000026000006231995\nБанк: АТ КБ «ПРИВАТБАНК»\nПризначення платежу: Організаційний внесок ПІБ учасника у «Всеукраїнський тренінг для менеджерів і адміністраторів науки»\n\nПроживання:\nКиївський національний університет імені Тараса Шевченка може запропонувати розміщення в готельному комплексі Інституту післядипломної освіти (ІПО) за адресою: вул. Васильківська, 36 (м. «Васильківська» – 5 хв пішки).\nЗ питань поселення можна звертатися до:\nОлени Почаєвець, 066 587 04 12, olena.pochaievets@knu.ua\n\nЗ нетерпінням чекаємо на зустріч у Києві на події, що поєднує професійне зростання, обмін досвідом і натхнення спільноти PNRM!\nПрограма заходу тут: [[pdf:/img/program2025.pdf]]`,
  },
  {
    id: 17,

    imageUrlUk: '/img/photo_news/news17_ua.png',
    imageUrlEn: '/img/photo_news/news17_en.png',
    title: 'Запрошуємо до участі в міжнародному дослідженні RAAAP-4',
    date: 'жовтень 2025',
    description: `PNRM Ukraine як учасник глобальної мережі INORMS запрошує вас долучитися до четвертого міжнародного опитування RAAAP-4 — масштабного дослідницького проєкту, що формує актуальний портрет професії академічного менеджера у світі.\nЦе дослідження продовжує створювати послідовний набір даних про нашу професійну спільноту, сприяючи глибшому розумінню потреб, викликів і перспектив у сфері управління дослідженнями.\nЧому це важливо?\nЗавдяки вашій участі ми зможемо:\n• сформувати рекомендації щодо навчання та професійного розвитку;\n• підтримати ефективні стратегії найму та утримання кадрів;\n• посилити голос українських фахівців на міжнародному рівні.\n\nХто організовує?\n\nОпитування авторизоване та підтримується INORMS — Міжнародною мережею товариств управління дослідженнями, до якої входить PNRM Ukraine. Його розробила робоча група INORMS RAAAP, що об’єднує понад 30 експертів з різних країн, зокрема:\n• Саймон Керрідж (Університет Кента, Велика Британія)\n• Мадхурі Дутта (Інститут глобального здоров’я імені Джорджа, Індія)\n• Мелінда Фішер (Університет Клемсона, США)\n• Крістіна Олівейра (Школа управління інформацією NOVA, Португалія)\n• Жозе Сантуш (Браганський політехнічний університет, Португалія)\n\nЯк долучитися?\n• ⏱️ Час заповнення: приблизно 20–30 хвилин\n• 🔗 Посилання на опитування: перейти до форми\n\nБудь ласка, зверніть увагу: опитування не можна пересилати до Росії, Ірану чи Північної Кореї без окремого дозволу, згідно з міжнародними санкціями.\nДізнатися більше:\n\n• Сторінка проєкту на сайті INORMS\n• Офіційний сайт RAAAP`,
  },
  {
    id: 16,

    imageUrlUk: '/img/photo_news/news16.png',
    imageUrlEn: '/img/photo_news/news16.png',
    title: 'Представники ПНРМ на 35-й щорічній конференції EAIE у Готенбурзі ',
    date: '9–12 вересня 2025',
    description: `Вже 3й рік поспіль PNRM Ukraine займає достойне місце на стенді Study in Ukraine.\n9–12 вересня 2025 року відбулася 35-та Щорічна конференція-виставка Європейської асоціації міжнародної освіти (EAIE) – одна з наймасштабніших подій у сфері інтернаціоналізації вищої освіти, у якій взяли участь члени PNRM. Цьогоріч PNRM представлялили іі активні члени: \nМарина Волощук (НРЗВО «Кам’янець-Подільський державний інститут») взяла участь у постер сесії, де представила результати  дослідження “Inclusion: socialisation via internationalisation”. Під час презентації відбулося жваве обговорення актуальних питань інклюзії, інтернаціоналізації та розширення можливостей молоді у сучасному суспільстві за участі представників університетів Бельгії, Швеції, Австрії, Нідерландів, Німеччини, Польщі та інших країн.\nТакож Тетяна Майборода, Ірина Штейміллер та Марина Волощук як активні члени Європейської асоціації міжнародної освіти взяли участь у дискусіях на різних міжнародних майданчиках. Вони привертали увагу світової академічної спільноти до ключових викликів та проблем української освіти, науки й суспільства загалом.`,
  },
  {
    id: 15,

    imageUrlUk: '/img/photo_news/news15.png',
    imageUrlEn: '/img/photo_news/news15.png',
    title:
      'ВІДКРИТО РЕЄСТРАЦІЮ НА ПРОГРАМУ MINT-UKRAINE: MICRO-CREDENTIALS AS AN INTERNATIONALISATION TOOL FOR UKRAINIAN UNIVERSITIES',
    date: '11 вересня 2025',
    description: `PNRM Ukraine запрошує представників українських закладів вищої освіти долучитися до програми змішаного навчання, присвяченої розвитку мікрокваліфікацій як інструменту інтернаціоналізації.\n📅 Кінцевий термін подачі заявок — 11 вересня 2025\n🔗 Форма реєстрації та умови участі https://www.uni-hannover.de/en/universitaet/internationales/cctonmoi/mint-ukraine#c175099\n\nПрограма MInT-Ukraine — це можливість:\n\n— Ознайомитися з європейськими практиками мікрокваліфікацій\n— Розвивати інституційну стратегію інтернаціоналізації\n— Налагодити партнерства з міжнародними організаціями\n\nОрганізатор: International Office LUH\nЗа підтримки: DAAD та BMBF у межах програми German-Ukrainian University Network\n\nПартнери:\n— Український державний центр міжнародної освіти (Study in Ukraine)\n— Професійна мережа менеджерів науки та освіти України (PNRM Ukraine)\n— Німецько-українське академічне товариство (DUAG)\n— National Erasmus+ Office Ukraine\n— EAIE: European Association for International Education \n\nУчасть у програмі — це крок до зміцнення міжнародної позиції українських ЗВО та розвитку нових освітніх форматів.`,
  },
  {
    id: 14,

    imageUrlUk: '/img/photo_news/news14.png',
    imageUrlEn: '/img/photo_news/news14.png',
    title:
      'Участь PNRM Ukraine у першому kick-off TPM проєкту #EUComplianceM4UA',
    date: '20-21 січня 2025',
    description: `20-21 січня 2025 року представники PNRM Ukraine взяли участь у першому kick-off TPM (Transnational Project Meeting) у межах проєетк #EUComplianceM4UA 'Implementation of the European approach of Compliance Management in higher education in Ukraine' (Впровадження європейського підходу комплаєнс-менеджменту у вищій освіті України), в якому PNRM виступає як асоційований партнер, задля поширення результатів проєкту та best practice.\n\nДо kick-off meeting долучились засновниця PNRM Ukraine Ганна Толстанова та чиннна голова правління Вікторія Гура. Ганна Толстанова виступила з вітальним словом, розповіла про історію, можливості та перспективи роботи організації.\n\nПід час дводенного kick-off meeting були обговорені питання менеджменту проєкту, проєкти організаційних документів сфері управління, десимінації та забезпечення якості, розглянуто концепцію тренінгів для українських партнерів та розробки освітнього контенту у сфері комплаєнс-менеджменту.\nГоловним координатором проєкту є Hochschule Wismar, University of Applied Sciences: Technology, Business and Design.\n\nЄвропейські партнери представлені:\nUniversidade Portucalense Infante D Henrique-Cooperativa de Ensino Superior Crl (UPT)\nVŠCHT Praha Vysoka Skola Chemico-Technologika v Praze (VSCHT) / The University of Chemistry and Technology, Prague\nWyższa Szkoła Przedsiębiorczości i Administracji w Lublinie (WSPA) / The University College of Enterprise and Administration in Lublin\n\nСеред українських університетів участь в проєкті приймають: \nCentral Ukrainian National Technical University (CUNTU)\nIzmail State University of Humanities  (ISUH)\nSimon Kuznets Kharkiv National University of Economics (S.KUZNETS KhNUE)\nDonetsk State University of Internal Affairs (DonSUIA)\nV. N. Karazin Kharkiv National University`,
  },
  {
    id: 13,

    imageUrlUk: '/img/photo_news/news13.png',
    imageUrlEn: '/img/photo_news/news13.png',
    title:
      'ВЗАЄМОДІЯ, ІННОВАЦІЇ ТА ЛІДЕРСТВО: ЩОРІЧНА ЗУСТРІЧ ПРОФЕСІЙНОЇ МЕРЕЖІ МЕНЕДЖЕРІВ НАУКИ ТА ОСВІТИ УКРАЇНИ',
    date: '21-22 жовтня 2024',
    description: `21-22 жовтня 2024 року відбулася ІІІ-тя щорічна зустріч представників, членів та партнерів Професійної мережі менеджерів науки та освіти України (PNRM Ukraine). Захід, що проводився у змішаному форматі, зібрав навколо себе численних фахівців та партнерів з різних куточків України, щоб поділитися досвідом, обмінятися знаннями та розвивати нові ідеї у сфері менеджменту науки та освіти.\n\nУ межах зустрічі відбулися щорічні збори членів PNRM, фокус-групи проєкту «Дорожня карта кар’єрного розвитку жінок-лідерок у вищій освіті в Україні», що реалізується за програмою проєктів у сфері гендерної рівності ініціативи Going Global Partnerships від Британської Ради, та ІІІ-й Міжнародний форум «Інтернаціоналізація українських закладів вищої освіти: німецько-український досвід». Цей проєкт реалізується в рамках програми підвищення кваліфікації для адміністраторів українських закладів вищої освіти в галузі освіти та академічного менеджменту за фінансової підтримки Німецької служби академічних обмінів (DAAD) та Федерального міністерства освіти і досліджень Німеччини (BMBF).\n\nПротягом двох днів учасники активно взаємодіяли, ділилися власним досвідом та розвивали нові ідеї. Мережа розширилася, а члени надихнулися на нові звершення. Адже менеджери – це ще й талановиті люди, здатні втілювати свої ідеї в життя! (посилання на блог менеджерів) \n\nУчасники мали можливість брати участь у дискусіях, обговореннях та воркшопах, де обговорювалися питання взаємодії та співпраці, інноваційного розвитку та лідерства у вищій освіті. Завдяки змішаному формату заходу, більше менеджерів змогли приєднатися до події та взяти активну участь у роботі.\n\nЗустріч Професійної мережі менеджерів науки та освіти України (PNRM Ukraine) стала черговим кроком до зміцнення співпраці та обміну знаннями серед менеджерів освіти та науки. Вона підтвердила, що через спільну роботу та обмін досвідом можна досягти значних результатів та розвивати освітні та наукові проєкти в Україні на високому рівні. Мережа продовжує розвиватися і надихати своїх членів на нові досягнення та успіхи!`,
  },
  {
    id: 12,

    imageUrlUk: '/img/photo_news/news12.png',
    imageUrlEn: '/img/photo_news/news12.png',
    title:
      'PNRM Ukraine та німецька мережа наукового менеджменту (Netzwerk Wissenschaftsmanagement) обмінялися досвідом ',
    date: '14 травня 2024',
    description: `14 травня 2024 PNRM Ukraine спільно з мережею наукового менеджменту в Німеччині (NWM) зустрілись в межах інтерактивного цифрового воркшопу: «Being Visible as a Science Manager». Він був організований Потсдамською аспірантською школою (PoGS), Міжнародним офісом Ганноверського університету для представників мереж, як частина DAAD проєкту “Management of Internationalisation and German-Ukrainian Academic Cooperation 2024” https://www.uni-hannover.de/en/universitaet/internationales/moi-ukraine \n\nМи відвідали цифрові кімнати де обмінялися  досвідом власної видимості, як наукових менеджерів. Визначили, що саме спонукає нас активно працювати над своєю видимістю.\n\nДалі відкрили кімнати з актуальними на сьогодні темами. Від PNRM кімнати створили Оксана Бережна, Костянтин Кириченко та Наталія Бовтрук. \n\nОксана Бережна – Генеральний директор директорату інновацій та звʼязків науки з реальним сектором економіки МОН України, Національний координатор COST в Україні; Співзасновник ГО «Професійна мережа менеджерів освіти і науки України». Автор проектів, спрямованих на стимулювання співпраці бізнесу та науки, посилення трансферу технологій та комерціалізації наукових результатів:  Веб-платформа «Наука і бізнес»; проєкт «Наука та бізнес» МОН та Українського фонду стартапів;  Info Science Bot - інформаційний телеграм-бот для швидкого інформування українців, Science&Business Online Mentor. \n\nКостянтин Кириченко – Помічник ректора з міжнародних зв'язків Сумського державного університету, Начальник відділу міжнародних справ, Кандидат технічних наук, доцент, Координатор Erasmus+, Координатор Twinning, Член Наглядової ради Альянсу університетів України.\n\nНаталія Бовтрук –  кандидатка педагогічних наук, експертка сфери освіти, науки та інновацій PNRM Ukraine, керівник комунікацій  ГО "Трініті хаб". \n\nЗ німецької сторони доповідачі: \n\nАліса Хон, адміністративний директор Інституту сільськогосподарської інженерії та біоекономіки імені Лейбніца (ATB), Потсдам, а також: голова адміністрації Інституту дослідження інфекцій на основі РНК імені Гельмгольца у Вюрцбурзі \n\nЛіа Ланг, менеджер з питань наукової кар’єри та талантів Асоціації Гельмгольца (делегована координатором DESY Diversität and Inclusion) і викладач Берлінського університету імені Гумбольдта \n\nҐерріт Ресслер, керівник програми, міжнародні зв’язки та наукові комунікації Департаменту вищої освіти та досліджень, охорони здоров’я та довгострокового догляду, Берлін, а також старший консультант програми german.innovation. \n\nПро що говорили? Звичайно про науку та комунікації. А ще Наталія Бовтрук під час другої інтерактивної кімнати зрозуміла, що вона запросить у свою кімнату, де поговорить про надважливу сьогодні для України тему.  Так, вона розповіла про новий  проєкт в Україні –  унікальний освітньо-реабілітаційний центр для осіб з порушеннями зору “Трініті хаб”. Наталія закликала до співпраці менеджерів освіти та науки, які займаються дослідженнями проблем осіб з порушеннями зору. \n\nБільше інфомації про проєкт тут: \nсайт: https://trinityhub.org.ua/ \nInstagram   https://www.instagram.com/trinity.hub.ua \nYouTube  https://www.youtube.com/@Trinity_hub2023 \nTikTok  https://www.tiktok.com/@trinity.hub.ua \n\nВисновок: крім мотивації, позитивних вражень і натхнення до нових проєктів, кожен відкрив для себе щось нове. Це і було основною ціллю заходу. З нетерпінням чекаємо на наступні цікаві події.`,
  },
  {
    id: 1,

    imageUrlUk: '/img/photo_news/новина 1.png',
    imageUrlEn: '/img/photo_news/новина 1.png',
    title:
      'PNRM-вці взяли участь у 3-му проєктному семінарі  “Навчальний курс: управління інтернаціоналізацією та німецько-українська академічна співпраця 2022-2023”',
    date: '2 червня 2023',
    description: `Сьогодні, 2 червня 2023 року  на базі Київського національного університету імені Тараса Шевченка відбувся 3-й проєктний семінар  “Навчальний курс: управління інтернаціоналізацією та німецько-українська академічна співпраця 2022-2023”.\n\nПід час заходу PNRM-ці презентували роботу Мережі, плани та перспективи, а також платформу, яка запрацює вже найближчим часом.\n\nЧлени Мережі провели загальні збори для прийняття результатів, звітів, обрання наглядової ради, а також плану на наступний рік.\n\nУсі хто не мав змоги доєднатися, нагадуємо, що ви є членами Професійної мережі менеджерів освіти і науки України, головна мета якої об'єднати менеджерів вищої освіти та науки з різних регіонів України з метою ефективної співпраці, реалізації освітнього та наукового потенціалу, налагодження взаємодії національних і міжнародних мереж.\n\nТому звертаємо увагу, що неактивних членів Мережі буде подано на розгляд загальних зборів, а також щойно новоствореної наглядової ради щодо позбавлення члества.\n\nВдячні тим, хто вірить у нашу роботу, а також активно приймаєте участь. Саме ми сьогодні, змінюємо культуру реалізації проєктів у сфері освіти, науки та інновацій України, а також популяризуємо нашу діяльність у світі.\n\nДякуємо що Ви з нами! Тримаємося! Все буде Україна! 💙💛\n\nПриєднуйтеся та розповідайте про нас у соціальних мережах, https://www.linkedin.com/company/pnrm-ukraine, https://twitter.com/pnrm_ukraine , або пишіть на електронну адресу:\n pnrm.ukraine@gmail.com.\n\nДля зручності працює телеграм-канал Мережі https://t.me/+YxvybUYgwGFhNzky, та чат членів https://t.me/+J1cr33Ae8pA3ZGMy.\n\nДякуємо що Ви з нами! Тримаємося! Все буде Україна!\n\nЯкщо Ви ще не отримуєте розсилку від Мережі заповніть анкету https://forms.gle/YCkTXopGUCJjgSfz9.`,
  },
  {
    id: 2,

    imageUrlUk: '/img/photo_news/новина 2.png',
    imageUrlEn: '/img/photo_news/новина 2.png',
    title: 'PNRM почала формуватися за напрямами',
    date: '23 грудня 2022',
    description: `Завершується надскладний рік для кожного з нас. Проте наперекір всьому маємо багато хороших подій цього року, які стали важливими роками до становлення сфери освіти та науки, а значить і України.\n\nСаме цього року почала формуватися Професійна мережа менеджерів освіти і науки України. Головна наша ціль - створити сильну мережу професіоналів сфери освіти та науки.\n\nМережа менеджерів уже почала формуватися за напрямами:\n\n1. Розвиток персональних компетентностей менеджера\n2. Грантова діяльність та міжнародний нетворк\n3. Якість вищої освіти\n4. Інновації та трансфер технологій\n5. Популяризація науки\n\nPNRM почала співпрацю з учасниками проєкту MolUkr та регіональної групи Берлін Брандербург Netzwerk Wissenschaftsmanagement. Спільно було організовано та проведено спільний вебінари в межах Virtual NWM Academy.\n\nУ вересня PNRM взяла участь у 32-й щорічній конференції Європейської асоціації міжнародної освіти. Під час заходу сфера вищої освіти України відзначена премією «EAIE-2022» у категорії «Візія та лідерство» від Європейської асоціації міжнародної освіти (EAIE). Переможцем премії за бачення та лідерство уперше за 32 роки стала не окрема організація, а сфера вищої освіти України в цілому за реакцію та стійкість під час жорстокої війни росії проти України.\n\nТак, маємо визнати це не все що ми планували. Але ми не зупинимося й будемо продовжувати формуватися.\n\nЩиро вітаємо Вас із прийдешніми святами! Нехай у кожного будуть здорові діти та батьки. Попри всі перешкоди, щоб усі мали достаток, а також реалізували усі ідеї та задумки.\n\nЗ Новим роком!\nЗ Різдвом Христовим!\n\nУсе буде Україна!`,
  },
  {
    id: 3,

    imageUrlUk: '/img/photo_news/новина 3.png',
    imageUrlEn: '/img/photo_news/новина 3.png',
    title: 'Мережа тепер має PNRM-канал',
    date: '16 грудня 2022',
    description: `16 грудня 2022 року, в онлайн-форматі відбулась Стратегічна сесія Професійної мережі менеджерів освіти і науки України. Обговорювалися важливі питання щоб продовжити формувати сильну мережу професіоналів сфери освіти та науки.\n\nМаємо ще одну новину. Щоб мати максимальний зв’язок із нами створюємо PNRM-канал. Щоб доєднатися переходьте за посиланням https://t.me/PNRMchannel.`,
  },
  {
    id: 4,

    imageUrlUk: '/img/photo_news/новина 4.png',
    imageUrlEn: '/img/photo_news/новина 4.png',
    title:
      'PNRM пропонує ознайомитися зі звітом опитування щодо заходів підтримки тих українських дослідників, які залишили Україну після російського вторгнення 24 лютого 2022 року',
    date: '3 грудня 2022',
    description: `PNRM пропонує ознайомитися зі звітом опитування щодо заходів підтримки тих українських дослідників, які залишили Україну після російського вторгнення 24 лютого 2022 року.\n\nРезультати пропонуються як емпіричні докази для планування програм підтримки науковими та фінансовими установами. Також може стати у пригоді під час проведення досліджень. Зокрема тут представлена інформація про демографічний профіль, дисципліну та етап кар’єри потребуючих науковців, а також про особливі професійні та життєві проблеми, з якими вони стикаються.\n\nОпитування базується на 619 відповідях, наданих українською дослідницькою спільнотою протягом червня-вересня 2022 року.\n\nДокладніше: https://bit.ly/3FrR3JK`,
  },
  {
    id: 5,

    imageUrlUk: '/img/photo_news/новина 5.png',
    imageUrlEn: '/img/photo_news/новина 5.png',
    title: 'Від масованих ракетних ударів рф постраждали офіси PNRM',
    date: '11 жовтня 2022',
    description: `10 жовтня 2022 року від масованих ракетних ударів рф постраждали будівлі Київського національного університету імені Тараса Шевченка. Це місце дало початок створення Професійної мережі менеджерів освіти і науки України. Постраждав офіс Міністерства освіти і науки України, а найбільше кабінети директорату науки та інновацій. Експерти цього підрозділу є частиною Мережі. А також, постраждав офіс Національного антарктичного наукового центру.\n\nСеред експертів, освітян та науковців ніхто не постраждав. Але від потужної вибухової хвилі значних руйнувань зазнала велика кількість зазначених офісів, пошкоджена оргтехніка, особисті речі тощо.\n\nЦими фото https://bit.ly/3VuSm1r , та повідомленням хочемо сповістити освітянську та наукову спільноту про черговий доказ воєнних злочинів росіян.`,
  },
  {
    id: 6,

    imageUrlUk: '/img/photo_news/новина 6.png',
    imageUrlEn: '/img/photo_news/новина 6.png',
    title: 'Відбулась перша сесія Віртуальної академії управління наукою',
    date: '28 вересня 2022',
    description: `Відбулась перша сесія Віртуальної академії управління наукою від Професійної мережі менеджерів освіти і науки України (PNRM Ukraine) спільно з Netzwerk Wissenschaftsmanagement (NWM Німеччина).\n\nТема заходу була присвячена побудові ефективної мережі для управління наукою. Освітяни й науковці з України, Німеччини та інших країн обговорювати питання для налагодження освітянської та наукової комунікації. Також учасники змогли обмінятися досвідом та завданнями для формування міжнародної мережі менеджерів освіти та науки.`,
  },
  {
    id: 7,

    imageUrlUk: '/img/photo_news/новина 7.png',
    imageUrlEn: '/img/photo_news/новина 7.png',
    title:
      'PNRM взяла участь у 32-й щорічній конференції Європейської асоціації міжнародної освіти',
    date: '16 вересня 2022',
    description: `Завершилася 32 щорічна конференція Європейської асоціації міжнародної освіти (European Association for International Education (EAIE)), яка проходила 13-16 вересня 2022 року в місті Барселона (Королівство Іспанія). У заході брала участь українська делегація, до складу якої увійшли представники Професійної мережі менеджерів освіти і науки України.\n\nПід час заходу сфера вищої освіти України відзначена премією «EAIE-2022» у категорії «Візія та лідерство» від Європейської асоціації міжнародної освіти (EAIE). Переможцем премії за бачення та лідерство уперше за 32 роки стала не окрема організація, а сфера вищої освіти України в цілому за реакцію та стійкість під час жорстокої війни росії проти України.\n\n«Сьогодні кожен українець обороняє нашу країну на своєму фронті. Під час повномасштабного вторгнення росії на територію України ми стали ще більш згуртовані, відчули нашу цілісність й силу, а також підтримку всього демократичного світу. Так, поштовхом до створення Професійної мережі менеджерів освіти і науки України, яка є першою українсько-європейською спільнотою для реалізації освітнього та наукового потенціалу без обмежень та кордонів, стала підтримка німецьких колег в межах проєкту DAAD MoI Ukraine (Management of Internationalisation and German-Ukrainian Academic Cooperation)», – зазначила співзасновниця PNRM Ганна Толстанова.\n\nУсього на конференції було представлено 213 стендів, які відвідали 6 тис. осіб. До українського стенду навідалися понад 500 представників університетів, дослідницьких установ та компаній, що надають освітні послуги.\n\nУ межах конференції проведено сесію «What's new in Ukraine», присвячену огляду теперішньої ситуації, новин у сфері вищої освіти, науки та інновацій в Україні, стійкості в умовах жорстокої війни російської федерації проти України, викликів переміщених університетів, впливу війни на науковців та інноваторів, можливостей та розбудови міжнародної співпраці. Під час сесії представлено інформацію про PNRM з метою розширення міжнародної співпраці мережі та інформування європейських колег про запроваджену ініціативу, візію та напрями діяльності.\n\nПредставники PNRM провели низку зустрічей з представниками європейських університетів, дослідницьких установ та компаній, що надають освітні послуги, заручились підтримкою та обговорили можливі спільні проєкти. Також відбулися перемовини щодо спільних тренінгів для професіоналізації менеджерів вищої освіти України з EAIE, Міністерством науки і освіти Каталонії.`,
  },
  {
    id: 8,

    imageUrlUk: '/img/photo_news/новина 8.png',
    imageUrlEn: '/img/photo_news/новина 8.png',
    title: 'Як освітяни захищають освітній фронт під час війни?',
    date: '26 червня 2022',
    description: `Як освітяни захищають освітній фронт під час війни? Відповідь на це важливе питання надала газеті “Світ” під час інтерв’ю проректорка з наукової роботи Київського національного університету імені Тараса Шевченка, професорка Ганна Толстанова.\n\nКрім того, що вона розповіла про навчання в умовах війни, роботу в нових реаліях, про нові стратегічно важливі кроки для можливостей українських учених щоб тісніше увійти в європейський дослідницький простір, отримати нові знання, продовжити свої дослідження тощо.\n\nЯк зазначила Ганна Толстанова, найкращим дієвим інструментом для України стане професійна мережа, неформальна платформа, де можна обговорити проблеми, ініціативи, проєкти, просто обмінятися думками.\n\n“Ми усі менеджери науки і освіти – не конкуруємо між собою. Навпаки, наше завдання – бути настільки високими професіоналами, щоб створити найкращий сервіс для вчених, для розвитку науки. І ми створили таку професійну мережу менеджерів науки вищої освіти. А також, нас уже підтримує аналогічна німецька асоціація та надає консультативну допомогу”, - підкреслила проректорка.\n\nНагадаємо, що нещодавно відбулася неформальна зустріч, на якій були представлені 36 університетів з різних регіонів України. Сформувався кістяк – 20 найбільш ініціативних, тих, хто хоче працювати, має ідеї. Ініціатив багато, тому запрошуємо доєднуватися та розвивати Мережу разом.`,
  },
  {
    id: 9,

    imageUrlUk: '/img/photo_news/новина 9.png',
    imageUrlEn: '/img/photo_news/новина 9.png',
    title: 'PNRM провели спільне засідання з німецькими колегами',
    date: '24 червня 2022',
    description: `24 червня 2022 року засновники Професійної мережі менеджерів освіти і науки України (PNRM) провели спільне засідання з участниками проєкту MolUkr та регіональної групи Берлін Брандербург Netzwerk Wissenschaftsmanagement. Під час онлайн-зустрічі було презентовано PNRM, стратегічне бачення майбутньої співпраці, а також результати діяльності PNRM. По завершенню заходу домовлено про організацію та проведення спільного віртуального круглого столу для нарощування потенціалу в межах Virtual NWM Academy.`,
  },
  {
    id: 10,
    imageUrlUk: '/img/photo_news/новина 10.png',
    imageUrlEn: '/img/photo_news/новина 10.png',
    title: 'PNRM офіційно зареєстрована в Єдиному державному реєстрі',
    date: '15 червня 2022',
    description: `Професійна мережа менеджерів освіти і науки України (PNRM) офіційно зареєстрована в Єдиному державному реєстрі. Вчора, 15 червня 2022 року відбулися чергові збори засновників організації. Зазначимо, головна наша ціль - створити сильну мережу професіоналів сфери освіти та науки.\n\nМережа менеджерів уже почала формуватися за напрямами:\n\n1. Розвиток персональних компетентностей менеджера\n2. Грантова діяльність та міжнародний нетворк\n3. Якість вищої освіти\n4. Інновації та трансфер технологій\n5. Популяризація науки`,
  },
  {
    id: 11,
    imageUrlUk: '/img/photo_news/новина 11.png',
    imageUrlEn: '/img/photo_news/новина 11.png',
    title: 'Відбулись установчі збори засновників PNRM',
    date: '1 червня 2022',
    description: `Відбулись установчі збори засновників Професійної мережі менеджерів освіти і науки України. Хто такі менеджери освіти і науки? Це компетентні фахівці, які допомагатимуть науковцям та освітянам впроваджувати інноваційні підходи щодо розвитку освітньої, науково-технічної та інноваційної діяльності, а також популяризації науки та встановлення міжнародних зв’язків. І все це в Україні та за її межами.`,
  },
]

function NewsDetail() {
  const intl = useIntl()
  const { newsIndex } = useParams()
  const selectedNews = newsList.find((news) => news.id === parseInt(newsIndex))

  if (!selectedNews) {
    return <div className="news__error">Error, page not found.</div>
  }

  const descriptionId = `newsDetail.news${selectedNews.id}.description`
  const description = intl.formatMessage({ id: descriptionId })

  const imageUrl =
    intl.locale === 'uk' ? selectedNews.imageUrlUk : selectedNews.imageUrlEn

  // Функція перевірки PDF-тега [[pdf:/img/file.pdf]]
  const renderWithPdfLinks = (text) => {
    if (text.includes('[[pdf:')) {
      const start = text.indexOf('[[pdf:')
      const end = text.indexOf(']]')

      const before = text.substring(0, start)
      const tag = text.substring(start + 6, end)
      const after = text.substring(end + 2)

      return (
        <p>
          {before}
          <a href={tag} target="_blank" rel="noopener noreferrer">
            <FormattedMessage id="newsDetail.openPdf" />
          </a>
          {after}
        </p>
      )
    }

    if (text.includes('http')) {
      const parts = text.split(' ')
      return (
        <p>
          {parts.map((part, index) =>
            part.startsWith('http') ? (
              <a
                key={index}
                href={part}
                target="_blank"
                rel="noopener noreferrer"
              >
                {part}
              </a>
            ) : (
              <span key={index}>{part} </span>
            )
          )}
        </p>
      )
    }

    return <p>{text}</p>
  }

  return (
    <div className="container">
      <div className="news-detail">
        <div className="news-detail__image">
          <img
            src={imageUrl}
            alt={intl.formatMessage({
              id: `newsDetail.news${selectedNews.id}.title`,
            })}
          />
        </div>

        <div className="news-detail__description">
          <div className="news-detail__text-1">
            <p>
              <FormattedMessage
                id={`newsDetail.news${selectedNews.id}.title`}
              />
            </p>
          </div>

          <div className="news-detail__date">
            <p>
              <FormattedMessage id={`newsDetail.news${selectedNews.id}.date`} />
            </p>
          </div>
        </div>
      </div>

      <div className="news-detail__text-2">
        {description.split('\n').map((paragraph, index) => (
          <React.Fragment key={index}>
            {renderWithPdfLinks(paragraph)}
          </React.Fragment>
        ))}
      </div>
    </div>
  )
}

export default NewsDetail
